---
kind: method
id: M:Autodesk.Revit.DB.DoubleArray.Append(System.Double@)
source: html/e2fb5c96-26fa-c578-7ab4-23c055583bd4.htm
---
# Autodesk.Revit.DB.DoubleArray.Append Method

## Syntax (C#)
```csharp
public virtual void Append(
	ref double item
)
```

## Parameters
- **item** (`System.Double %`)